from PIL import Image, ImageDraw, ImageFont
import os




kana_list = [
    ('a',  'あ', 'ア'), ('i', 'い', 'イ'), ('u', 'う', 'ウ'), ('e', 'え', 'エ'), ('o', 'お', 'オ'),
    ('ka', 'か', 'カ'), ('ki', 'き', 'キ'), ('ku', 'く', 'ク'), ('ke', 'け', 'ケ'), ('ko', 'こ', 'コ'),
    ('sa', 'さ', 'サ'), ('shi', 'し', 'シ'), ('su', 'す', 'ス'), ('se', 'せ', 'セ'), ('so', 'そ', 'ソ'),
    ('ta', 'た', 'タ'), ('chi', 'ち', 'チ'), ('tsu', 'つ', 'ツ'), ('te', 'て', 'テ'), ('to', 'と', 'ト'),
    ('na', 'な', 'ナ'), ('ni', 'に', 'ニ'), ('nu', 'ぬ', 'ヌ'), ('ne', 'ね', 'ネ'), ('no', 'の', 'ノ'),
    ('ha', 'は', 'ハ'), ('hi', 'ひ', 'ヒ'), ('fu', 'ふ', 'フ'), ('he', 'へ', 'ヘ'), ('ho', 'ほ', 'ホ'),
    ('ma', 'ま', 'マ'), ('mi', 'み', 'ミ'), ('mu', 'む', 'ム'), ('me', 'め', 'メ'), ('mo', 'も', 'モ'),
    ('ya', 'や', 'ヤ'), ('yu', 'ゆ', 'ユ'), ('yo', 'よ', 'ヨ'),
    ('ra', 'ら', 'ラ'), ('ri', 'り', 'リ'), ('ru', 'る', 'ル'), ('re', 'れ', 'レ'), ('ro', 'ろ', 'ロ'),
    ('wa', 'わ', 'ワ'), ('wo', 'を', 'ヲ'),
    ('n',  'ん', 'ン'),
    ('ga', 'が', 'ガ'), ('gi', 'ぎ', 'ギ'), ('gu', 'ぐ', 'グ'), ('ge', 'げ', 'ゲ'), ('go', 'ご', 'ゴ'),
    ('za', 'ざ', 'ザ'), ('ji', 'じ', 'ジ'), ('zu', 'ず', 'ズ'), ('ze', 'ぜ', 'ゼ'), ('zo', 'ぞ', 'ゾ'),
    ('da', 'だ', 'ダ'), ('dji', 'ぢ', 'ヂ'), ('dzu', 'づ', 'ヅ'), ('de', 'で', 'デ'), ('do', 'ど', 'ド'),
    ('ba', 'ば', 'バ'), ('bi', 'び', 'ビ'), ('bu', 'ぶ', 'ブ'), ('be', 'べ', 'ベ'), ('bo', 'ぼ', 'ボ'),
    ('pa', 'ぱ', 'パ'), ('pi', 'ぴ', 'ピ'), ('pu', 'ぷ', 'プ'), ('pe', 'ぺ', 'ペ'), ('po', 'ぽ', 'ポ')
]

yoo_on_list = [
    ('kya', 'きゃ', 'キャ'), ('kyu', 'きゅ', 'キュ'), ('kyo', 'きょ', 'キョ'),
    ('sha', 'しゃ', 'シャ'), ('shu', 'しゅ', 'シュ'), ('sho', 'しょ', 'ショ'),
    ('cha', 'ちゃ', 'チャ'), ('chu', 'ちゅ', 'チュ'), ('cho', 'ちょ', 'チョ'),
    ('nya', 'にゃ', 'ニャ'), ('nyu', 'にゅ', 'ニュ'), ('nyo', 'にょ', 'ニョ'),
    ('hya', 'ひゃ', 'ヒャ'), ('hyu', 'ひゅ', 'ヒュ'), ('hyo', 'ひょ', 'ヒョ'),
    ('mya', 'みゃ', 'ミャ'), ('myu', 'みゅ', 'ミュ'), ('myo', 'みょ', 'ミョ'),
    ('rya', 'りゃ', 'リャ'), ('ryu', 'りゅ', 'リュ'), ('ryo', 'りょ', 'リョ'),
    ('gya', 'ぎゃ', 'ギャ'), ('gyu', 'ぎゅ', 'ギュ'), ('gyo', 'ぎょ', 'ギョ'),
    ('ja', 'じゃ', 'ジャ'), ('ju', 'じゅ', 'ジュ'), ('jo', 'じょ', 'ジョ'),
    ('dja', 'ぢゃ', 'ヂャ'), ('dju', 'ぢゅ', 'ヂュ'), ('djo', 'ぢょ', 'ヂョ'),
    ('bya', 'びゃ', 'ビャ'), ('byu', 'びゅ', 'ビュ'), ('byo', 'びょ', 'ビョ'),
    ('pya', 'ぴゃ', 'ピャ'), ('pyu', 'ぴゅ', 'ピュ'), ('pyo', 'ぴょ', 'ピョ')
]


def generate(k, sz):
    font_path = r'simsun.ttc'
    w, h = 180, 120
    x, y = 0, 0
    font = ImageFont.truetype(font_path, sz)
    for c in k: 
        def n(): return Image.new('RGB', (w, h), color='white')
        def draw(pref, char):
            img = n()
            dr = ImageDraw.Draw(img)
            dr.text((x, y), char, fill='black', font=font)
            img.save(f'img/{pref}_{c[0]}.bmp')
        draw('h', c[1])
        draw('k', c[2])        


def main():

    if not os.path.exists('img'):
        os.makedirs('img')
    
    
    generate(kana_list, 110)
    generate(yoo_on_list, 90)
    
    
    
    
if __name__ == "__main__":
    main()